# TableCellStyle Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableCellStyle Constructor
TableCellStyle Class See Also
---
Constructs a new TableCellStyle with default settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public TableCellStyle()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
TableCellStyle()
```

# See Also
TableCellStyle Class
TableCellStyle Overload
Autodesk.Revit.DB Namespace